Revit 2027 API
BendingDetailDimensionTextPosition Enumeration
 Describes how the text will be positioned with respect to dimension line.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum BendingDetailDimensionTextPosition
Public Enumeration BendingDetailDimensionTextPosition
public enum class BendingDetailDimensionTextPosition
type BendingDetailDimensionTextPosition
Members
Member name | Value | Description
Default | 0 |  The text will be positioned according to the default behavior.
OutsideOfDimensionLine | 1 |  The text will be positioned on the outside of the dimension line, where inside is represented by the bar curves.
See Also
Reference
Autodesk.Revit.DB.Structure Namespace